In [50]:
import numpy as np

In [51]:
import pandas as pd

In [52]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                       "key2" : pd.Series([1, 2, 1, 2, 1, None, 1],
                                          dtype="Int64"),
                       "data1" : np.random.standard_normal(7),
                       "data2" : np.random.standard_normal(7)})

In [53]:
df

   key1  key2     data1     data2
0     a     1 -0.010701 -0.410687
1     a     2  2.227716 -0.445132
2  None     1 -1.216804 -1.731846
3     b     2 -0.666682  1.181399
4     b     1  0.890625 -0.765003
5     a  <NA> -0.753272  0.830171
6  None     1  1.059057  0.993817

In [54]:
grouped = df["data1"].groupby(df["key1"])

In [55]:
grouped

In [56]:
grouped.mean()

key1
a    0.487914
b    0.111972
Name: data1, dtype: float64

In [57]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [58]:
means

key1  key2
a     1      -0.010701
      2       2.227716
b     1       0.890625
      2      -0.666682
Name: data1, dtype: float64

In [59]:
means.unstack()

key2         1         2
key1
a    -0.010701  2.227716
b     0.890625 -0.666682

In [60]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])

years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]

df["data1"].groupby([states, years]).mean()

CA  2005    0.737222
    2006   -1.216804
OH  2005   -0.338691
    2006    0.974841
Name: data1, dtype: float64

In [61]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5  0.487914 -0.008549
b      1.5  0.111972  0.208198

In [62]:
df.groupby("key2").mean(numeric_only=True)

         data1     data2
key2
1     0.180544 -0.478430
2     0.780517  0.368134

In [63]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1    -0.010701 -0.410687
     2     2.227716 -0.445132
b    1     0.890625 -0.765003
     2    -0.666682  1.181399

In [64]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [65]:
df.groupby("key1", dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [66]:
df.groupby(["key1", "key2"], dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [67]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [68]:
for name, group in df.groupby("key1"):
        print(name)
        print(group)

a
  key1  key2     data1     data2
0    a     1 -0.010701 -0.410687
1    a     2  2.227716 -0.445132
5    a  <NA> -0.753272  0.830171
b
  key1  key2     data1     data2
3    b     2 -0.666682  1.181399
4    b     1  0.890625 -0.765003

In [69]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
        print((k1, k2))
        print(group)

('a', 1)
  key1  key2     data1     data2
0    a     1 -0.010701 -0.410687
('a', 2)
  key1  key2     data1     data2
1    a     2  2.227716 -0.445132
('b', 1)
  key1  key2     data1     data2
4    b     1  0.890625 -0.765003
('b', 2)
  key1  key2     data1     data2
3    b     2 -0.666682  1.181399

In [70]:
grouped = df.groupby({"key1": "key", "key2": "key",
                          "data1": "data", "data2": "data"}, axis="columns")

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\2570192252.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby({"key1": "key", "key2": "key",

In [71]:
for group_key, group_values in grouped:
        print(group_key)
        print(group_values)

data
      data1     data2
0 -0.010701 -0.410687
1  2.227716 -0.445132
2 -1.216804 -1.731846
3 -0.666682  1.181399
4  0.890625 -0.765003
5 -0.753272  0.830171
6  1.059057  0.993817
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

In [72]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    1    -0.410687
     2    -0.445132
b    1    -0.765003
     2     1.181399

In [73]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                          columns=["a", "b", "c", "d", "e"],
                          index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [74]:
people.iloc[2:3, [1, 2]] = np.nan

In [75]:
people

              a         b         c         d         e
Joe    1.736878 -0.755770 -0.128952 -0.292554  1.723019
Steve  0.234341  0.760143  0.080816  1.696571 -0.831296
Wanda -0.746960       NaN       NaN  0.016630  0.986958
Jill  -0.777901  0.216140  1.151326 -0.486050 -0.037858
Trey   1.315846  0.103735 -0.767955  0.464488  1.594474

In [76]:
mapping = {"a": "red", "b": "red", "c": "blue",
               "d": "blue", "e": "red", "f" : "orange"}

In [77]:
by_column = people.groupby(mapping, axis="columns")

by_column.sum()

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\2866191139.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis="columns")

           blue       red
Joe   -0.421506  2.704127
Steve  1.777387  0.163188
Wanda  0.016630  0.239999
Jill   0.665276 -0.599620
Trey  -0.303468  3.014056

In [78]:
map_series = pd.Series(mapping)

In [79]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [80]:
people.groupby(map_series, axis="columns").count()

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\2727320543.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis="columns").count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

In [81]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.736878 -0.755770 -0.128952 -0.292554  1.723019
4  0.537945  0.319875  0.383371 -0.021562  1.556616
5 -0.512618  0.760143  0.080816  1.713201  0.155662

In [82]:
key_list = ["one", "one", "one", "two", "two"]

In [83]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  1.736878 -0.755770 -0.128952 -0.292554  1.723019
4 two -0.777901  0.103735 -0.767955 -0.486050 -0.037858
5 one -0.746960  0.760143  0.080816  0.016630 -0.831296

In [84]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
                                        [1, 3, 5, 1, 3]],
                                        names=["cty", "tenor"])

In [85]:
hier_df = pd.DataFrame(np.random.standard_normal((4, 5)), columns=columns)

In [86]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.004762  0.048378 -0.047314 -0.492387 -0.654909
1      1.341322 -0.146200  0.789760 -0.506056 -0.991400
2      1.103118 -0.130216  0.411808  0.451189 -0.037413
3     -1.206735 -0.682098 -0.658909 -0.646847 -0.249229

In [87]:
hier_df.groupby(level="cty", axis="columns").count()

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\2795167867.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="cty", axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [88]:
df

   key1  key2     data1     data2
0     a     1 -0.010701 -0.410687
1     a     2  2.227716 -0.445132
2  None     1 -1.216804 -1.731846
3     b     2 -0.666682  1.181399
4     b     1  0.890625 -0.765003
5     a  <NA> -0.753272  0.830171
6  None     1  1.059057  0.993817

In [91]:
grouped = df.groupby("key1")

grouped["data1"].nsmallest(2)

key1
a     5   -0.753272
      0   -0.010701
b     3   -0.666682
      4    0.890625
Name: data1, dtype: float64

In [89]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [92]:
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  2.980989  1.275303
b        1  1.557307  1.946402

In [93]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0  0.487914  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.111972  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a     1.108508  2.227716   3.0 -0.008549  0.726557 -0.445132 -0.427910
b     0.501298  0.890625   2.0  0.208198  1.376314 -0.765003 -0.278402


           50%       75%       max
key1
a    -0.410687  0.209742  0.830171
b     0.208198  0.694799  1.181399

[2 rows x 24 columns]

In [94]:
tips = pd.read_csv("textbook/examples/tips.csv")

In [95]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [96]:
tips["tip_pct"] = tips["tip"] / tips["total_bill"]

In [97]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [98]:
grouped = tips.groupby(["day", "smoker"])

In [99]:
grouped_pct = grouped["tip_pct"]

grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [100]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [101]:
grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\1734782830.py:1: FutureWarning: The provided callable <function std at 0x000001EE7FBEE340> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

              average     stdev
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [102]:
functions = ["count", "mean", "max"]

In [103]:
result = grouped[["tip_pct", "total_bill"]].agg(functions)

In [104]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [105]:
result["tip_pct"]

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [106]:
ftuples = [("Average", "mean"), ("Variance", np.var)]

In [107]:
grouped[["tip_pct", "total_bill"]].agg(ftuples)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\365474927.py:1: FutureWarning: The provided callable <function var at 0x000001EE7FBEE480> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  grouped[["tip_pct", "total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [108]:
grouped.agg({"tip" : np.max, "size" : "sum"})

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\2044707828.py:1: FutureWarning: The provided callable <function max at 0x000001EE7FBED800> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({"tip" : np.max, "size" : "sum"})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [109]:
grouped.agg({"tip_pct" : ["min", "max", "mean", "std"],
                 "size" : "sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [110]:
grouped = tips.groupby(["day", "smoker"], as_index=False)

In [111]:
grouped.mean(numeric_only=True)

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [112]:
def top(df, n=5, column="tip_pct"):
        return df.sort_values(column, ascending=False)[:n]

In [113]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [114]:
tips.groupby("smoker").apply(top)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\2530541573.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [115]:
tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\643835440.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [118]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
                          "data2": np.random.standard_normal(1000)})

In [120]:
quartiles = pd.cut(frame["data1"], 4)

In [116]:
def get_stats(group):
        return pd.DataFrame(
            {"min": group.min(), "max": group.max(),
            "count": group.count(), "mean": group.mean()}
        )

In [121]:
grouped = frame.groupby(quartiles)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\4041437760.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = frame.groupby(quartiles)

In [122]:
grouped.apply(get_stats)

                             min       max  count      mean
data1
(-2.965, -1.533] data1 -2.959751 -1.534491     54 -1.972949
                 data2 -1.997274  2.114680     54  0.091564
(-1.533, -0.106] data1 -1.517235 -0.113449    407 -0.691907
                 data2 -2.217529  2.762577    407  0.070664
(-0.106, 1.321]  data1 -0.104915  1.320734    460  0.532887
                 data2 -2.936131  2.971282    460 -0.027096
(1.321, 2.748]   data1  1.332611  2.747915     79  1.714610
                 data2 -2.435199  2.622329     79  0.244856

In [123]:
grouped.agg(["min", "max", "count", "mean"])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-2.965, -1.533] -2.959751 -1.534491    54 -1.972949 -1.997274  2.114680
(-1.533, -0.106] -1.517235 -0.113449   407 -0.691907 -2.217529  2.762577
(-0.106, 1.321]  -0.104915  1.320734   460  0.532887 -2.936131  2.971282
(1.321, 2.748]    1.332611  2.747915    79  1.714610 -2.435199  2.622329


                 count      mean
data1
(-2.965, -1.533]    54  0.091564
(-1.533, -0.106]   407  0.070664
(-0.106, 1.321]    460 -0.027096
(1.321, 2.748]      79  0.244856

In [124]:
quartiles_samp = pd.qcut(frame["data1"], 4, labels=False)

In [125]:
quartiles_samp.head()

0    2
1    3
2    1
3    3
4    2
Name: data1, dtype: int64

In [126]:
grouped = frame.groupby(quartiles_samp)

In [127]:
grouped.apply(get_stats)

                  min       max  count      mean
data1
0     data1 -2.959751 -0.668744    250 -1.240746
      data2 -2.191553  2.345315    250  0.051139
1     data1 -0.663889 -0.019683    250 -0.320467
      data2 -2.217529  2.971282    250  0.059615
2     data1 -0.018929  0.663064    250  0.320350
      data2 -2.779730  2.634333    250  0.071958
3     data1  0.673328  2.747915    250  1.210609
      data2 -2.936131  2.622329    250 -0.020376

In [128]:
s = pd.Series(np.random.standard_normal(6))

In [129]:
s[::2] = np.nan

In [130]:
s

0         NaN
1   -0.390590
2         NaN
3    0.153205
4         NaN
5    1.073332
dtype: float64

In [131]:
s.fillna(s.mean())

0    0.278649
1   -0.390590
2    0.278649
3    0.153205
4    0.278649
5    1.073332
dtype: float64

In [132]:
states = ["Ohio", "New York", "Vermont", "Florida",
              "Oregon", "Nevada", "California", "Idaho"]

group_key = ["East", "East", "East", "East",
                 "West", "West", "West", "West"]

In [133]:
data = pd.Series(np.random.standard_normal(8), index=states)

In [134]:
data

Ohio          0.290258
New York     -0.397442
Vermont       1.386132
Florida       0.710626
Oregon        0.543450
Nevada        0.494823
California   -1.613986
Idaho         0.435229
dtype: float64

In [135]:
data[["Vermont", "Nevada", "Idaho"]] = np.nan

In [136]:
data

Ohio          0.290258
New York     -0.397442
Vermont            NaN
Florida       0.710626
Oregon        0.543450
Nevada             NaN
California   -1.613986
Idaho              NaN
dtype: float64

In [138]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [139]:
data.groupby(group_key).count()

East    3
West    2
dtype: int64

In [140]:
data.groupby(group_key).mean()

East    0.201147
West   -0.535268
dtype: float64

In [141]:
def fill_mean(group):
        return group.fillna(group.mean())

In [142]:
data.groupby(group_key).apply(fill_mean)

East  Ohio          0.290258
      New York     -0.397442
      Vermont       0.201147
      Florida       0.710626
West  Oregon        0.543450
      Nevada       -0.535268
      California   -1.613986
      Idaho        -0.535268
dtype: float64

In [143]:
fill_values = {"East": 0.5, "West": -1}

In [144]:
def fill_func(group):
        return group.fillna(fill_values[group.name])

In [145]:
data.groupby(group_key).apply(fill_func)

East  Ohio          0.290258
      New York     -0.397442
      Vermont       0.500000
      Florida       0.710626
West  Oregon        0.543450
      Nevada       -1.000000
      California   -1.613986
      Idaho        -1.000000
dtype: float64

In [146]:
suits = ["H", "S", "C", "D"]  # Hearts, Spades, Clubs, Diamonds
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ["A"] + list(range(2, 11)) + ["J", "K", "Q"]
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [147]:
deck.head(13)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [148]:
def draw(deck, n=5):
        return deck.sample(n)

In [150]:
draw(deck)

KD     10
8C      8
3D      3
10D    10
AS      1
dtype: int64

In [151]:
def get_suit(card):
        # last letter is suit
        return card[-1]

In [152]:
deck.groupby(get_suit).apply(draw, n=2)

C  QC     10
   10C    10
D  9D      9
   3D      3
H  2H      2
   10H    10
S  2S      2
   6S      6
dtype: int64

In [153]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

9C      9
10C    10
2D      2
10D    10
10H    10
9H      9
8S      8
2S      2
dtype: int64

In [154]:
df = pd.DataFrame({"category": ["a", "a", "a", "a",
                                    "b", "b", "b", "b"],
                       "data": np.random.standard_normal(8),
                       "weights": np.random.uniform(size=8)})

In [155]:
df

  category      data   weights
0        a -1.305000  0.828030
1        a  0.725535  0.857729
2        a -0.590446  0.199963
3        a -1.228054  0.063757
4        b -1.235288  0.241989
5        b  0.022869  0.130554
6        b -0.432527  0.450872
7        b  0.569310  0.237920

In [156]:
grouped = df.groupby("category")

In [157]:
def get_wavg(group):
        return np.average(group["data"], weights=group["weights"])

In [158]:
grouped.apply(get_wavg)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_19656\4286695940.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped.apply(get_wavg)

category
a   -0.335797
b   -0.334960
dtype: float64

In [159]:
close_px = pd.read_csv("textbook/examples/stock_px.csv", parse_dates=True,
                           index_col=0)

In [160]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [161]:
close_px.tail(4)

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [162]:
def spx_corr(group):
        return group.corrwith(group["SPX"])

In [163]:
rets = close_px.pct_change().dropna()

In [164]:
def get_year(x):
        return x.year

In [165]:
by_year = rets.groupby(get_year)

In [166]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [167]:
def corr_aapl_msft(group):
        return group["AAPL"].corr(group["MSFT"])

In [168]:
by_year.apply(corr_aapl_msft)

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [169]:
import statsmodels.api as sm
def regress(data, yvar=None, xvars=None):
    Y = data[yvar]
    X = data[xvars]
    X["intercept"] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [170]:
by_year.apply(regress, yvar="AAPL", xvars=["SPX"])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [171]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4,
                       'value': np.arange(12.)})

In [172]:
df

   key  value
0    a    0.0
1    b    1.0
2    c    2.0
3    a    3.0
4    b    4.0
5    c    5.0
6    a    6.0
7    b    7.0
8    c    8.0
9    a    9.0
10   b   10.0
11   c   11.0

In [173]:
g = df.groupby('key')['value']

In [174]:
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [175]:
def get_mean(group):
        return group.mean()

In [176]:
g.transform(get_mean)

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [177]:
g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [180]:
def times_two(group):
        return group * 2

In [179]:
g.transform(times_two)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11    22.0
Name: value, dtype: float64

In [181]:
def get_ranks(group):
        return group.rank(ascending=False)

In [182]:
g.transform(get_ranks)

0     4.0
1     4.0
2     4.0
3     3.0
4     3.0
5     3.0
6     2.0
7     2.0
8     2.0
9     1.0
10    1.0
11    1.0
Name: value, dtype: float64

In [183]:
def normalize(x):
        return (x - x.mean()) / x.std()

In [184]:
g.transform(normalize)

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [185]:
g.apply(normalize)

key
a    0    -1.161895
     3    -0.387298
     6     0.387298
     9     1.161895
b    1    -1.161895
     4    -0.387298
     7     0.387298
     10    1.161895
c    2    -1.161895
     5    -0.387298
     8     0.387298
     11    1.161895
Name: value, dtype: float64

In [186]:
 g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [188]:
normalized = (df['value'] - g.transform('mean')) / g.transform('std')

In [189]:
normalized

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [190]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [191]:
tips.pivot_table(index=["day", "smoker"],
                     values=["size", "tip", "tip_pct", "total_bill"])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [192]:
tips.pivot_table(index=["time", "day"], columns="smoker",
                     values=["tip_pct", "size"])

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [193]:
tips.pivot_table(index=["time", "day"], columns="smoker",
                     values=["tip_pct", "size"], margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803